***Getting and Knowing your Data***

1.Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv). Assign it to a variable called chipo

In [4]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"
chipo = pd.read_table(url)

In [6]:
#Alternatevely
chipo1 = pd.read_csv(url, sep='\t')
chipo1.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

3. See the first 10 entries

In [ ]:
chipo.head(10)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98
5         3  ...     $10.98
6         3  ...      $1.69
7         4  ...     $11.75
8         4  ...      $9.25
9         5  ...      $9.25

[10 rows x 5 columns]

4. What is the number of observations in the dataset?

In [7]:
#correct answer
print(chipo.shape[0]) # entries <= 4622 observations
print(chipo.info()) # entries <= 4622 observations

4622
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB
None

5. What is the number of columns in the dataset?

In [ ]:
len(chipo.columns)

5

In [8]:
#Alternative Approach
chipo.shape[1]

5

6. Print the name of all the columns.

In [ ]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

7. How is the dataset indexed?

In [9]:
#Correct answer
chipo.index

RangeIndex(start=0, stop=4622, step=1)

8.Which was the most-ordered item?

In [15]:
#correct answer
most_order = chipo.groupby('item_name')
most_order = most_order.sum()
most_order = most_order.sort_values(['quantity'], ascending= False)
most_order.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

9. For the most-ordered item, how many items were ordered?

Same as question No. 8

10.What was the most ordered item in the choice_description column?

In [22]:
#correct answer
CD = chipo.groupby('choice_description').sum()
CD = CD.sort_values(['quantity'], ascending=False)
CD.head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

11. How many items were orderd in total?

In [ ]:
chipo['quantity'].sum()

4972

12. Turn the item price into a float. Check the item price type

In [23]:
chipo.item_price.dtype

dtype('O')

12.b Create a lambda function and change the type of item price

In [24]:
convert_price = lambda x: float(x[1:-1])
chipo.item_price = chipo.item_price.apply(convert_price)

12.C Check the item price type

In [25]:
chipo.item_price.dtype

dtype('float64')

13. How much was the revenue for the period in the dataset?

In [26]:
revenue = (chipo['quantity']* chipo['item_price']).sum()

print('Revenue was: $' + str(np.round(revenue,2)))

Revenue was: $39237.02

14. How many orders were made in the period?

In [27]:
orders = chipo.order_id.value_counts().count()
orders

1834

15. What is the average revenue amount per order?

In [31]:
chipo['revenue'] = chipo['quantity'] * chipo['item_price']
order_grouped = chipo.groupby(by=['order_id']).sum()
order_grouped.mean()['revenue']

16. How many different items are sold?

In [29]:
chipo['item_name'].value_counts().count()

50